SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/M6LN4FD4MR/RetrievePNRRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>6DTH</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">TravelItineraryReadRQ</eb:Service>       <eb:Action>TravelItineraryReadRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Price Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/ACPCRTD!ICESMSLB\/CRT.LB!1539654704438!1324150!65537</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <TravelItineraryReadRQ  xmlns="http://services.sabre.com/res/tir/v3_6" TimeStamp="2018-10-15T20:52:04-05:00"  Version="3.6.0">       <MessagingDetails>           <SubjectAreas>               <SubjectArea>FULL</SubjectArea>           </SubjectAreas>       </MessagingDetails>       <UniqueID  ID="RKAUHJ"/>       <EchoToken/>    </TravelItineraryReadRQ></soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>6DTH</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">TravelItineraryReadRQ</eb:Service>       <eb:Action>TravelItineraryReadRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Price Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/ACPCRTD!ICESMSLB\/CRT.LB!1539655518900!1328624!196609</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <TravelItineraryReadRQ  xmlns="http://services.sabre.com/res/tir/v3_6" TimeStamp="2018-03-07T05:17:44-06:00"  Version="3.6.0">       <MessagingDetails>           <SubjectAreas>               <SubjectArea>FULL</SubjectArea>           </SubjectAreas>       </MessagingDetails>       <UniqueID  ID="RKAUHJ"/>       <EchoToken/>    </TravelItineraryReadRQ></soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>6DTH</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">TravelItineraryReadRQ</eb:Service>       <eb:Action>TravelItineraryReadRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Price Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/ACPCRTC!ICESMSLB\/CRT.LB!1539655591661!1327218!65537</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <TravelItineraryReadRQ  xmlns="http://services.sabre.com/res/tir/v3_6" TimeStamp="2018-03-07T05:17:44-06:00"  Version="3.6.0">       <MessagingDetails>           <SubjectAreas>               <SubjectArea>FULL</SubjectArea>           </SubjectAreas>       </MessagingDetails>       <UniqueID  ID="RKAUHJ"/>       <EchoToken/>    </TravelItineraryReadRQ></soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>6DTH</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">TravelItineraryReadRQ</eb:Service>       <eb:Action>TravelItineraryReadRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Price Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/ACPCRTC!ICESMSLB\/CRT.LB!1539655777889!1327936!65537</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <TravelItineraryReadRQ  xmlns="http://services.sabre.com/res/tir/v3_6" TimeStamp="2018-03-07T05:17:44-06:00"  Version="3.6.0">       <MessagingDetails>           <SubjectAreas>               <SubjectArea>FULL</SubjectArea>           </SubjectAreas>       </MessagingDetails>       <UniqueID  ID="RKAUHJ"/>       <EchoToken/>    </TravelItineraryReadRQ></soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>6DTH</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">TravelItineraryReadRQ</eb:Service>       <eb:Action>TravelItineraryReadRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Price Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/CERTG!ICESMSLB\/CRT.LB!1539659862610!1342301!65537</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <TravelItineraryReadRQ  xmlns="http://services.sabre.com/res/tir/v3_6" TimeStamp="2018-03-07T05:17:44-06:00"  Version="3.6.0">       <MessagingDetails>           <SubjectAreas>               <SubjectArea>FULL</SubjectArea>           </SubjectAreas>       </MessagingDetails>       <UniqueID  ID="RKAUHJ"/>       <EchoToken/>    </TravelItineraryReadRQ></soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>6DTH</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">TravelItineraryReadRQ</eb:Service>       <eb:Action>TravelItineraryReadRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Price Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/ACPCRTC!ICESMSLB\/CRT.LB!1539660281268!1346390!131073</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <TravelItineraryReadRQ  xmlns="http://services.sabre.com/res/tir/v3_6" TimeStamp="2018-03-07T05:17:44-06:00"  Version="3.6.0">       <MessagingDetails>           <SubjectAreas>               <SubjectArea>FULL</SubjectArea>           </SubjectAreas>       </MessagingDetails>       <UniqueID  ID="RKAUHJ"/>       <EchoToken/>    </TravelItineraryReadRQ></soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>6DTH</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">TravelItineraryReadRQ</eb:Service>       <eb:Action>TravelItineraryReadRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Price Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/CERTG!ICESMSLB\/CRT.LB!1539660452631!1342956!262145</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <TravelItineraryReadRQ  xmlns="http://services.sabre.com/res/tir/v3_6" TimeStamp="2018-03-07T05:17:44-06:00"  Version="3.6.0">       <MessagingDetails>           <SubjectAreas>               <SubjectArea>FULL</SubjectArea>           </SubjectAreas>       </MessagingDetails>       <UniqueID  ID="RKAUHJ"/>       <EchoToken/>    </TravelItineraryReadRQ></soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>6DTH</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">TravelItineraryReadRQ</eb:Service>       <eb:Action>TravelItineraryReadRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Price Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/CERTG!ICESMSLB\/CRT.LB!1539660625831!1344841!65537</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <TravelItineraryReadRQ  xmlns="http://services.sabre.com/res/tir/v3_6" TimeStamp="2018-03-07T05:17:44-06:00"  Version="3.6.0">       <MessagingDetails>           <SubjectAreas>               <SubjectArea>FULL</SubjectArea>           </SubjectAreas>       </MessagingDetails>       <UniqueID  ID="RKAUHJ"/>       <EchoToken/>    </TravelItineraryReadRQ></soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>6DTH</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">TravelItineraryReadRQ</eb:Service>       <eb:Action>TravelItineraryReadRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Price Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/ACPCRTC!ICESMSLB\/CRT.LB!1539661249405!1349020!196609</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <TravelItineraryReadRQ  xmlns="http://services.sabre.com/res/tir/v3_6" TimeStamp="2018-03-07T05:17:44-06:00"  Version="3.6.0">       <MessagingDetails>           <SubjectAreas>               <SubjectArea>FULL</SubjectArea>           </SubjectAreas>       </MessagingDetails>       <UniqueID  ID="RKAUHJ"/>       <EchoToken/>    </TravelItineraryReadRQ></soapenv:Body></soapenv:Envelope><?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>6DTH</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">TravelItineraryReadRQ</eb:Service>       <eb:Action>TravelItineraryReadRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Price Service</eb:Description>   </eb:MessageHeader><sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">   <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/CERTG!ICESMSLB\/CRT.LB!1539666981750!1369013!131073</sec:BinarySecurityToken></sec:Security></soapenv:Header><soapenv:Body>    <TravelItineraryReadRQ  xmlns="http://services.sabre.com/res/tir/v3_6" TimeStamp="2018-03-07T05:17:44-06:00"  Version="3.6.0">       <MessagingDetails>           <SubjectAreas>               <SubjectArea>FULL</SubjectArea>           </SubjectAreas>       </MessagingDetails>       <UniqueID  ID="RKAUHJ"/>       <EchoToken/>    </TravelItineraryReadRQ></soapenv:Body></soapenv:Envelope>